adyenv6core/resources/test/SaleToPOIResponsePaymentCancelled.json

{
  "SaleToPOIResponse": {
    "MessageHeader": {
      "ProtocolVersion": "3.0",
      "MessageClass": "Service",
      "MessageCategory": "Payment",
      "MessageType": "Response",
      "ServiceID": "1058665998",
      "SaleID": "electronics",
      "POIID": "V400m-346489243"
    },
    "PaymentResponse": {
      "Response": {
        "AdditionalResponse": "tid=46489243&transactionType=GOODS_SERVICES&backendGiftcardIndicator=false&posadditionalamounts.originalAmountValue=800&posAmountGratuityValue=0&giftcardIndicator=false&store=MyStore&txtime=15%3a11%3a07&iso8601TxDate=2019-10-14T13%3a11%3a07.0000000%2b0000&posOriginalAmountValue=800&txdate=14-10-2019&shopperReference=16eebd8c-8c1b-48e3-b6e8-67734d960af5&shopperEmail=renato.martins%40adyen.com&merchantReference=00025003&pinBlockISOFormat=0&posadditionalamounts.originalAmountCurrency=EUR&posAuthAmountCurrency=EUR&message=108%20Shopper%20cancelled%20tx&posAmountCashbackValue=0&posAuthAmountValue=800",
        "Result": "Failure",
        "ErrorCondition": "Cancel"
      },
      "SaleData": {
        "SaleTransactionID": {
          "TransactionID": "00025003",
          "TimeStamp": "2019-10-14T13:11:06.334Z"
        }
      },
      "POIData": {
        "POITransactionID": {
          "TransactionID": "93yV001571058667005",
          "TimeStamp": "2019-10-14T13:11:07.000Z"
        },
        "POIReconciliationID": "1000"
      },
      "PaymentResult": {
        "PaymentInstrumentData": {
          "CardData": {},
          "PaymentInstrumentType": "Card"
        },
        "PaymentAcquirerData": {
          "MerchantID": "TestMerchantRenatoTest",
          "AcquirerPOIID": "V400m-346489243"
        },
        "OnlineFlag": true
      }
    }
  }
}